game-scenario.yml
config:
  target: "{{ $env.TARGET }}"
  socketio: 
    query: 'game-id={{ $env.GAME_ID }}'
  phases:
    - duration: 40 # 테스트 시간
      arrivalRate: 5 # 1초에 몇 명의 유저가 들어올 것인지 설정 (arrivalRate * duration = 총 유저 수)
  processor: "processors.js" 

scenarios:
  - name: "1-minute 200 players test"
    engine: socketio
    flow:
      - function: 'setPlayerName'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'